# In addition to the Apache 2.0 license, this content is also licensed
# under the Creative Commons Attribution-ShareAlike 3.0 Unported license
# (see http://creativecommons.org/licenses/by-sa/3.0/). 

# This is a translation contributed by volunteers on Zanata
# https://translate.zanata.org/project/view/shib-idpv3-translations
# so that internationalized translations can be made available and
# You find the latest version on the Shibboleth Wiki:
# https://wiki.shibboleth.net/confluence/display/IDP4/MessagesTranslation
idp.css=/css/cuni.css
AccessDenied=access
ContextCheckDenied=context-check-denied
EndpointResolutionFailed=endpoint
ImpersonationViolation=impersonation-violation
InvalidProfileConfiguration=relying-party
InvalidSecurityConfiguration=security-cfg
MessageAuthenticationError=security-msg
MessageReplay=stale
MessageExpired=stale
UnableToDecode=stale
AccountError=authn
AccountLocked=account-locked
AuthenticationException=authn
InvalidCredentials=authn
InvalidCSRFToken=invalid-csrf-token
NoCredentials=authn
NoPotentialFlow=authn
RequestUnsupported=authn
SubjectCanonicalizationError=authn
InvalidAttributeContext=unexpected
InvalidAuthenticationContext=unexpected
InvalidSubjectContext=unexpected
InvalidSubjectCanonicalizationContext=unexpected
InvalidMessage=unexpected
InvalidMessageContext=unexpected
InvalidMessageVersion=unexpected
InvalidProfileContext=unexpected
InvalidRelyingPartyContext=unexpected
InvalidRelyingPartyConfiguration=unexpected
MessageProcessingError=unexpected
UnableToEncode=unexpected
UnableToSign=unexpected
UnableToEncrypt=unexpected
AttributeReleaseRejected=no-release
TermsRejected=no-terms
RuntimeException=runtime-error
InvalidEvent=invalid-event
UnknownUsername=bad-username
InvalidPassword=bad-password
ExpiredPassword=expired-password
SPNEGONotAvailable=spnego-unavailable
NTLMUnsupported=ntlm
NoSuchFlowExecutionException=stale
FlowExecutionRestorationFailureException=stale
ExternalAuthenticationException=stale
idp.title=Slu\u017Eba webov\u00E9ho p\u0159ihl\u00E1\u0161en\u00ED
idp.title.suffix=Chyba
idp.logo=/images/cuni-logo.png
idp.logo.alt-text=Vym\u011B\u0148te nebo odstra\u0148te toto logo
idp.message=Nastala neidentifikovateln\u00E1 chyba.
idp.footer=Sem vlo\u017Ete sv\u016Fj text pati\u010Dky.
root.title=Centr\u00E1ln\u00ED autentiza\u010Dn\u00ED slu\u017Eba
root.message=Na t\u00E9to adrese se nenach\u00E1z\u00ED \u017E\u00E1dn\u00E1 slu\u017Eba.
root.footer=Sem vlo\u017Ete sv\u016Fj text pati\u010Dky.
idp.client-storage-read.title=Nahr\u00E1v\u00E1n\u00ED stavu sezen\u00ED
idp.client-storage-read.text=Nahr\u00E1v\u00E1n\u00ED informac\u00ED o p\u0159ihl\u00E1\u0161en\u00E9m sezen\u00ED z prohl\u00ED\u017Ee\u010De...
idp.client-storage-write.title=Ukl\u00E1d\u00E1n\u00ED stavu sezen\u00ED
idp.client-storage-write.text=Ukl\u00E1d\u00E1n\u00ED informac\u00ED o p\u0159ihl\u00E1\u0161en\u00E9m sezen\u00ED do prohl\u00ED\u017Ee\u010De...
idp.client-storage.no-js=Jeliko\u017E V\u00E1\u0161 prohl\u00ED\u017Ee\u010D nepodporuje JavaScript, pro pokra\u010Dov\u00E1n\u00ED klikn\u011Bte na tla\u010D\u00EDtko Pokra\u010Dovat.
idp.login.loginTo=P\u0159ihl\u00E1sit se k
idp.login.username=U\u017Eivatelsk\u00E9 jm\u00E9no
idp.login.password=Heslo
idp.login.donotcache=Nepamatovat p\u0159ihl\u00E1\u0161en\u00ED.
idp.login.login=P\u0159ihl\u00E1\u0161en\u00ED
idp.login.pleasewait=P\u0159ihla\u0161ov\u00E1n\u00ED prob\u00EDh\u00E1, pros\u00EDm, \u010Dekejte...
idp.login.forgotPassword=Zapomn\u011Bli jste sv\u00E9 heslo?
idp.login.needHelp=Pot\u0159ebujete pomoc?
idp.login.duoRequired=Pro po\u017Eadovanou slu\u017Ebu je vy\u017Eadov\u00E1na autentizace pomoc\u00ED technologie Duo.
idp.login.duoNoScript=Slu\u017Eba Duo vy\u017Eaduje JavaScript.
idp.login.duoCancel=Zru\u0161it tento po\u017Eadavek
idp.login.expiringSoon=Va\u0161emu heslu brzy vypr\u0161\u00ED platnost\!
idp.login.changePassword=Pro vytvo\u0159en\u00ED nov\u00E9ho hesla nyn\u00ED, jdete na
idp.login.proceedBegin=Va\u0161e p\u0159ihl\u00E1\u0161en\u00ED bude pokra\u010Dovat b\u011Bhem 20 sekund, p\u0159\u00EDpadn\u011B m\u016F\u017Eete kliknout
idp.login.proceedHere=zde
idp.login.proceedEnd=pro pokra\u010Dov\u00E1n\u00ED
idp.url.password.reset=\#
idp.url.helpdesk=#
idp.userprefs.title=Slu\u017Eba webov\u00E9ho p\u0159ihl\u00E1\u0161en\u00ED
idp.userprefs.title.suffice=Vlastnosti p\u0159ihl\u00E1\u0161en\u00ED
idp.userprefs.info=Tato str\u00E1nka v\u00E1m umo\u017En\u00ED nastavit va\u0161e za\u0159\u00EDzen\u00ED, \u017Ee slu\u017Eba webov\u00E9ho p\u0159ihl\u00E1\u0161en\u00ED bude moci vyu\u017E\u00EDt pokro\u010Dil\u00E9 zp\u016Fsoby p\u0159ihla\u0161ov\u00E1n\u00ED, kter\u00E9 jsou v\u00EDce praktick\u00E9, ale ne v\u017Edy pou\u017Eiteln\u00E9.
idp.userprefs.options=Jsou dostupn\u00E9 n\u00E1sleduj\u00EDc\u00ED volby\:
idp.userprefs.spnego=Automaticky zkusit syst\u00E9mov\u00E9 (desktopov\u00E9) p\u0159ihl\u00E1\u0161en\u00ED, je-li dostupn\u00E9.
idp.userprefs.no-js=Tato funkce pot\u0159ebuje JavaScript.
idp.logout.sp-initiated=Byl(a) jste odhl\u00E1\u0161en(a) z n\u00E1sleduj\u00EDc\u00EDch slu\u017Eeb\:
idp.logout.prompt=Zvolte jednu z n\u00E1sleduj\u00EDc\u00EDch mo\u017Enost\u00ED, nebo po\u010Dkejte n\u011Bkolik sekund pro v\u00FDchoz\u00ED mo\u017Enost.
idp.logout.idponly=Odhl\u00E1sit lok\u00E1ln\u011B
idp.logout.idponly.caption=Ukon\u010Dit Va\u0161e SSO sezen\u00ED.
idp.logout.global=Odhl\u00E1sit glob\u00E1ln\u011B
idp.logout.global.caption=Ukon\u010Dit Va\u0161e SSO sezen\u00ED a pokusit se o odhl\u00E1\u0161en\u00ED ze v\u0161ech slu\u017Eeb, ke kter\u00FDm jste b\u011Bhem sezen\u00ED p\u0159istoupili.
idp.logout.cancel=Zru\u0161it
idp.logout.cancel.caption=Zru\u0161it odhl\u00E1\u0161en\u00ED a ponechat Va\u0161e SSO sezen\u00ED.
idp.logout.contactServices=Budete-li pokra\u010Dovat, syst\u00E9m se pokus\u00ED kontaktovat n\u00E1sleduj\u00EDc\u00ED slu\u017Eby\:
idp.logout.complete=Proces odhl\u00E1\u0161en\u00ED je dokon\u010Den. B\u011Bhem tohoto sezen\u00ED nedo\u0161lo k p\u0159ihl\u00E1\u0161en\u00ED k \u017E\u00E1dn\u00E9 dal\u0161\u00ED slu\u017Eb\u011B.
idp.logout.local=Zvolil/a jste neodhla\u0161ovat od slu\u017Eeb, ke kter\u00FDm jste p\u0159istoupil/a b\u011Bhem tohoto sezen\u00ED.
idp.logout.attempt=Pokus o odhl\u00E1\u0161en\u00ED z n\u00E1sleduj\u00EDc\u00EDch slu\u017Eeb\:
idp.logout.cancelled=Odhl\u00E1\u0161en\u00ED bylo zru\u0161eno.
idp.logout.ask=Chcete se pokusit o odhl\u00E1\u0161en\u00ED od v\u0161ech slu\u017Eeb pou\u017Eit\u00FDch p\u0159i tomto sezen\u00ED? Pros\u00EDm, zvolte <strong>Ano</strong> nebo <strong>Ne</strong> k dokon\u010Den\u00ED odhla\u0161ovac\u00EDho procesu, nebo po\u010Dkejte n\u011Bkolik sekund pro potvrzen\u00ED (Ano).
idp.attribute-release.revoke=Smazat p\u0159ede\u0161l\u00E9 povolen\u00ED k uvoln\u011Bn\u00ED Va\u0161ich informac\u00ED pro tuto slu\u017Ebu.
idp.attribute-release.title=Uvoln\u011Bn\u00ED informac\u00ED
idp.attribute-release.attributesHeader=Informace poskytnut\u00E9 slu\u017Eb\u011B
idp.attribute-release.serviceNameLabel=Chyst\u00E1te se p\u0159ihl\u00E1sit ke slu\u017Eb\u011B\:
idp.attribute-release.of=od
idp.attribute-release.serviceDescriptionLabel=Slu\u017Ebou poskytnut\u00FD popis\:
idp.attribute-release.informationURLLabel=Dodate\u010Dn\u00E9 informace o slu\u017Eb\u011B
idp.attribute-release.privacyStatementURLLabel=Informace o ochran\u011B \u00FAdaj\u016F slu\u017Eby
idp.attribute-release.showDetails=zobrazit detaily
idp.attribute-release.accept=P\u0159ijmout
idp.attribute-release.reject=Odm\u00EDtnout
idp.attribute-release.confirmationQuestion=Budete-li pokra\u010Dovat, informace uveden\u00E9 v\u00FD\u0161e budou poskytnuty slu\u017Eb\u011B, ke kter\u00E9 se p\u0159ihla\u0161ujete. Souhlas\u00EDte s uvol\u0148ov\u00E1n\u00EDm t\u011Bchto informac\u00ED kdykoliv budete ke slu\u017Eb\u011B v budoucnu p\u0159istupovat?
idp.attribute-release.consentMethod=Zvolte, jak dlouho m\u00E1 platit souhlas s uvol\u0148ov\u00E1n\u00EDm informac\u00ED\:
idp.attribute-release.consentMethodRevoke=Toto nastaven\u00ED m\u016F\u017Ee b\u00FDt kdykoliv odvol\u00E1no pomoc\u00ED za\u0161krt\u00E1vac\u00EDho pol\u00ED\u010Dka na p\u0159ihla\u0161ovac\u00ED str\u00E1nce.
idp.attribute-release.doNotRememberConsent=Zeptat se znovu p\u0159i dal\u0161\u00EDm p\u0159ihl\u00E1\u0161en\u00ED
idp.attribute-release.doNotRememberConsentItem=Souhlas\u00EDm s odesl\u00E1n\u00EDm sv\u00FDch informac\u00ED pro toto konkr\u00E9tn\u00ED p\u0159ihl\u00E1\u0161en\u00ED.
idp.attribute-release.rememberConsent=Zeptat se m\u011B znovu, pokud se zm\u011Bn\u00ED informace pos\u00EDlan\u00E9 t\u00E9to slu\u017Eb\u011B
idp.attribute-release.rememberConsentItem=Souhlas\u00EDm, aby stejn\u00E9 informace byly posl\u00E1ny t\u00E9to slu\u017Eb\u011B automaticky i v budoucnu.
idp.attribute-release.globalConsent=Ji\u017E se znovu neptat.
idp.attribute-release.globalConsentItem=Souhlas\u00EDm, \u017Ee <strong>v\u0161echny</strong> m\u00E9 informace budou odesl\u00E1ny <strong>jak\u00E9koliv</strong> slu\u017Eb\u011B.
idp.terms-of-use.accept=Souhlas\u00EDm s podm\u00EDnkami u\u017Eit\u00ED
idp.terms-of-use.submit=Odeslat
idp.terms-of-use.reject=Odm\u00EDtnout
idp.terms-of-use.required=Pros\u00EDm, za\u0161krtn\u011Bte toto pol\u00ED\u010Dko, chcete-li pokra\u010Dovat.
idp.impersonate.header=Imitace \u00FA\u010Dtu
idp.impersonate.text=Zadejte n\u00E1zev imitovan\u00E9ho \u00FA\u010Dtu pro tuto slu\u017Ebu nebo pokra\u010Dujte norm\u00E1ln\u011B.
idp.impersonate.login-as=P\u0159ihl\u00E1sit jako
idp.impersonate.impersonate=Imitovat
idp.impersonate.continue=Pokra\u010Dovat norm\u00E1ln\u011B
idp.unlock-keys.title=Odemknut\u00ED kl\u00ED\u010De pro doprovodn\u00FD restart
idp.unlock-keys.keystorePassword=Heslo k DataSealer kl\u00ED\u010Dence
idp.unlock-keys.keyPassword=Heslo k DataSealer kl\u00ED\u010Di
idp.unlock-keys.privateKeyPassword=Heslo k priv\u00E1tn\u00EDmu kl\u00ED\u010Di
idp.unlock-keys.unlock=Odemknout
idp.unlock-keys.cancel=Zru\u0161it
idp.unlock-keys.complete=Syst\u00E9m je odemknut a p\u0159ipraven k pou\u017Eit\u00ED.
idp.unlock-keys.error=Odemknut\u00ED se nezda\u0159ilo, zkontrolujte logy pro specifi\u010Dt\u011Bj\u0161\u00ED informace.
https\://sp.example.org=example-tou-1
example-tou-1.title=Podm\u00EDnky u\u017Eit\u00ED - p\u0159\u00EDklad
example-tou-1.text=<em>*** Toto je p\u0159\u00EDklad Podm\u00EDnek k u\u017Eit\u00ED - p\u0159izp\u016Fsobte sv\u00FDm pot\u0159eb\u00E1m (Nejsem pr\u00E1vn\u00EDk, tak\u017Ee se do n\u00E1sleduj\u00EDc\u00EDho p\u0159ekladu nebudu pou\u0161t\u011Bt) ***</em> <p>Example organization AAI services\: Terms of Use (ToU)</p> <strong>A. Data Protection Sample Clause</strong> <p> "The End User notes that personal data about the End User is compiled from generally available sources and from communications received from the End User and other Universities as well as from off-site sources. The policy relating to the use and procession of such data is posted on the University website at [...]. Such data will be used, inter alia, to authenticate and authorize the access to and use of various resources within the University and on other sites ("Approved Uses"). The End User hereby consents to the collection, processing, use and release of such data to the extent reasonably necessary for the Approved Uses. Such consent includes, but is not limited to, the release of personal data to other institutions by employing cookies and electronically exchanging, caching and storing personal authorization attributes." </p> <strong>B. Limitation of Liability</strong> <p> "To the extent permitted by the applicable law, the End User hereby waives all and any claims for cost and damages, whether direct or indirect, incidental, or consequential(including, inter alia, loss of use and lost profits), both in contract and in tort, arising from the use or in any way related to the inter-organizational authentication and authorization services which allow the End User to access certain resources of other organizations. This waiver of claims shall be valid and effective in relation to all participants of the inter-organizational authentication and authorization services including the AAI Service Provider and its affiliates, officers, employees and agents." </p>
access.title=P\u0159\u00EDstup zam\u00EDtnut
access.message=Nem\u00E1te p\u0159\u00EDstup k po\u017Eadovan\u00E9mu zdroji.
context-check-denied.title=P\u0159\u00EDstup zam\u00EDtnut
context-check-denied.message=Nem\u00E1te opr\u00E1vn\u011Bn\u00ED pro p\u0159\u00EDstup k t\u00E9to slu\u017Eb\u011B.
impersonation-violation.title=P\u0159\u00EDstup zam\u00EDtnut
impersonation-violation.message=Nem\u00E1te pr\u00E1va k imitaci zvolen\u00E9ho \u00FA\u010Dtu.
no-release.title=Uvoln\u011Bn\u00ED informac\u00ED neumo\u017En\u011Bno
no-release.message=Uvoln\u011Bn\u00ED informac\u00ED bylo na Va\u0161i \u017E\u00E1dost zak\u00E1z\u00E1no. P\u0159ejete-li si zm\u011Bnit sv\u00E9 rozhodnut\u00ED, m\u016F\u017Eete ke slu\u017Eb\u011B p\u0159istoupit znovu a odsouhlasit uvoln\u011Bn\u00ED informac\u00ED.
no-terms.title=Podm\u00EDnky u\u017Eit\u00ED odm\u00EDtnuty
no-terms.message=Kv\u016Fli odm\u00EDtnut\u00ED podm\u00EDnek u\u017Eit\u00ED byl p\u0159\u00EDstup ke slu\u017Eb\u011B zam\u00EDtnut. P\u0159ejete-li si zm\u011Bnit sv\u00E9 rozhodnut\u00ED, m\u016F\u017Eete ke slu\u017Eb\u011B p\u0159istoupit znovu a odsouhlasit podm\u00EDnky u\u017Eit\u00ED.
authn.title=P\u0159ihl\u00E1\u0161en\u00ED selhalo
authn.message=U\u017Eivatelsk\u00E9 p\u0159ihl\u00E1\u0161en\u00ED nebylo \u00FAsp\u011B\u0161n\u00E9, nebo nebylo dosa\u017Eeno po\u017Eadavk\u016F aplikace, ke kter\u00E9 se hl\u00E1s\u00EDte.
bad-username.message=Zadan\u00E9 u\u017Eivatelsk\u00E9 jm\u00E9no nebylo nalezeno.
bad-password.message=Zadan\u00E9 heslo nen\u00ED spr\u00E1vn\u00E9.
expired-password.message=Platnost Va\u0161eho hesla vypr\u0161ela.
account-locked.message=V\u00E1\u0161 \u00FA\u010Det je zablokovan\u00FD.
spnego-unavailable.message=V\u00E1\u0161 webov\u00FD prohl\u00ED\u017Ee\u010De nepodporuje autentizaci pomoc\u00ED syst\u00E9mov\u00FDch (desktopov\u00FDch) p\u0159ihla\u0161ovac\u00EDch \u00FAdaj\u016F.
spnego-unavailable.return=Zru\u0161it pokus.
ntlm.message=V\u00E1\u0161 webov\u00FDch prohl\u00ED\u017Ee\u010D se pokusil vyjednat slab\u0161\u00ED zp\u016Fsob syst\u00E9mov\u00E9 (desktopov\u00E9) autentizace.
endpoint.title=Odpov\u011B\u010F selhala
endpoint.message=P\u0159ihla\u0161ovac\u00ED slu\u017Eba nedok\u00E1zala identifikovat kompatibiln\u00ED zp\u016Fsob odpov\u011Bdi pro \u017E\u00E1daj\u00EDc\u00ED aplikaci. To b\u00FDv\u00E1 obecn\u011B zp\u016Fsobeno chybnou konfigurac\u00ED na stran\u011B aplikace a m\u011Blo by b\u00FDt ohl\u00E1\u0161eno spr\u00E1vc\u016Fm anebo vlastn\u00EDkovi aplikace.
relying-party.title=Nepodporovan\u00E1 \u017E\u00E1dost
relying-party.message=Nav\u0161t\u00EDven\u00E1 aplikace nen\u00ED registrov\u00E1na pro pou\u017Eit\u00ED touto slu\u017Ebou.
security-cfg.title=Chyba v nastaven\u00ED zabezpe\u010Den\u00ED
security-cfg.message=P\u0159ihla\u0161ovac\u00ED slu\u017Eba a nav\u0161t\u00EDven\u00E1 aplikace nejsou kompatibiln\u00ED co do bezpe\u010Dnosti, tak\u017Ee po\u017Eadavek nem\u016F\u017Ee b\u00FDt spln\u011Bn.
security-msg.title=Chyba zabezpe\u010Den\u00ED zpr\u00E1vy
security-msg.message=Po\u017Eadavek nem\u016F\u017Ee b\u00FDt dokon\u010Den, proto\u017Ee obdr\u017Een\u00E1 zpr\u00E1va nespl\u0148uje bezpe\u010Dnostn\u00ED po\u017Eadavky p\u0159ihla\u0161ovac\u00ED slu\u017Eby.
stale.title=Pro\u0161l\u00E1 \u017E\u00E1dost
stale.message=<p>Tato str\u00E1nka se pravd\u011Bpodobn\u011B zobrazila po pou\u017Eit\u00ED tla\u010D\u00EDtka Zp\u011Bt v prohl\u00ED\u017Ee\u010Di b\u011Bhem prohl\u00ED\u017Een\u00ED zabezpe\u010Den\u00E9ho webu nebo aplikace. P\u0159\u00EDpadn\u011B byla pou\u017Eita v z\u00E1lo\u017Ece adresa webov\u00E9ho p\u0159ihla\u0161ovac\u00EDho formul\u00E1\u0159e nam\u00EDsto adresy odpov\u00EDdaj\u00EDc\u00ED str\u00E1nky.</p><br/><p>To m\u016F\u017Ee v n\u011Bkter\u00FDch prohl\u00ED\u017Ee\u010D\u00EDch v\u00E9st k chyb\u00E1m nebo k p\u0159esm\u011Brov\u00E1n\u00ED na str\u00E1nku, kterou se sna\u017E\u00EDte opustit. Aby se tak nestalo, je zobrazena tato str\u00E1nka.</p>
unexpected.title=Neo\u010Dek\u00E1van\u00E1 chyba
unexpected.message=Nastala neo\u010Dek\u00E1van\u00E1 chyba, kter\u00E1 je pravd\u011Bpodobn\u011B zp\u016Fsobena konfigura\u010Dn\u00ED nebo softwarovou chybou.
runtime-error.title=Neo\u0161et\u0159en\u00E1 v\u00FDjimka
runtime-error.message=<p>Nastala chyba softwaru, kter\u00E1 zabra\u0148uje obvykl\u00E9 \u010Dinnosti\:</p><br/> <p><strong>\#if($exception)$encoder.encodeForHTML($exception.toString())\#elseif($flowExecutionException && $flowExecutionException.getCause())$encoder.encodeForHTML($flowExecutionException.getCause().toString())\#else$encoder.encodeForHTML($flowExecutionException.getMessage())\#end</strong></p><br/> <p>Pros\u00EDm, oznamte tento probl\u00E9m podpo\u0159e. Chyba byla tak\u00E9 ulo\u017Eena do log\u016F, aby ji mohl administr\u00E1tor prozkoumat.</p>
invalid-event.title=Neplatn\u00E1 ud\u00E1lost
invalid-event.message=<p>Z\u00E1kladn\u00ED software narazil na ud\u00E1lost, na kterou nebyl naprogramov\u00E1n.</p><br/> <p>Pros\u00EDm oznamte tento probl\u00E9m va\u0161emu spr\u00E1vci. Probl\u00E9m byl t\u00E9\u017E zalogov\u00E1n, aby ho mohl spr\u00E1vce p\u0159ezkoumat.</p>
invalid-csrf-token.title=Chyba p\u0159i zpracov\u00E1n\u00ED
invalid-csrf-token.message=Ov\u011B\u0159en\u00ED CSRF tokenu selhalo.
error.title=Chyba
error.message=Nastala chyba\: $eventId
